//Масивът е съвкупност от еднотипни елементи. Няма как да има смесени данни като числа, текст, дробно число и т.н
//Позияцията (index) на всеки елемент в масива се брои от 0
//Maсива се дефинира с квадратни скоби []
//Без да знаем стойностите в масива винаги можем да вземем неговия първи и последен елемент
//първи елемент: Console.Writeline(името на масива[0]);
//последен елемент: Console.WriteLine(името на масива[името на масива.Length -1]);
//По този начин първия и последния елемент са сигурни и винаги могат да бъдат намерени.
//Ако не знаем дължината на масива можем да я намерим с командата: Console.Writeline(името на масива.Length)
//Ако не знаем кои елементи ще се съхраняват в паметта намасива, можем да създадем празен масив, но трябва задължително да знаем колко на брой неща ще съхраняваме в него като по късно могат да се дефинират стойностите.
//Празен масив: int[] prices = new int[10]; 
//Задаване на стойност в празния масив в който знаем единсвено че ще съхраняваме 10 елемента:
//prices[0] = 5;
//prices[1] = 34;
//prices[2] = 56;
//prices[3] = 98; и т.н.
// командата .Split взима текст и го прави на масив 
// командата .Join взима масива и го прави на текст
// Цикълът Foreach се използва ако ще работим с елементите на масива без да ни интересуват индексите