
                                //Листи (LISTS)

//Както масивите листите също съхранява съвкупност от еднотипни елементи.
//Плюсовете са че на листите може да не се задава първоначалната му дължина а той сам се преоразмерява.
//Листа се създава с команда List<int> (име на листа максимално говорящо за това какво се съхранява в листа).
//Големината на списъците е динамична може да се променя а не фиксирана както при масива.
//Елементи в листа се добавят с вградени команди - ИМЕ НА ЛИСТА.Add
//Листите имар размер а масивите дължина.
//Рамера на листа се взима с командата Console.WriteLine(име.Count);
//Общото между масива и листите отново си имат място (index)
//От листа могат и да се премахват елементи с команрата ИмеНаЛиста.Remove
//Могат да се вмъкват стойности в листа на точно определено място(index) с командата Insert(1(номер на индекс), стойност);
//Проверка дали даден елемент съществува в списъка(листа) .Conteins(връща true или false).
//Сортиране на данните в списака по нарастващ ред .Sort
//Ako искаме по намаляващ ред .Reverse - обръща листа или масива на обратно след сортирането

//Koга да използваме масив? - съвкупсност от елементи, която няма да модифицираме повече.
//Кога да използваме лист? - съвкупност от елементи, които ще модифицираме.